first_routes_and_controllers/app/controllers/artworks_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def index
        @user = User.find(params[:user_id])

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def show
        @artwork = Artwork.find(params[:id])

INSERT INTO "artworks" ("title", "image_url", "created_at", "updated_at", "artist_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Starry Night"], ["image_url", "www.abc.com"], ["created_at", "2022-06-30 17:43:42.492180"], ["updated_at", "2022-06-30 17:43:42.492180"], ["artist_id", 2]]
---
    def create
        @artwork = Artwork.new(artwork_params)
        if @artwork.save