first_routes_and_controllers/app/controllers/comments_controller.rb

    def index
        render params
        if params[:user_id]
            @user = User.find(params[:user_id])
            render json: @user.comments
        elsif params[:artwork_id]
            @artwork = Artwork.find(params[:artwork_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

    def create
       @comment = Comment.new(comment_params)

       if @comment.save
---
INSERT INTO "comments" ("commenter_id", "artwork_id", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["commenter_id", 3], ["artwork_id", 2], ["body", "Good art!"], ["created_at", "2022-06-30 18:22:24.403188"], ["updated_at", "2022-06-30 18:22:24.403188"]]