first_routes_and_controllers/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "kyleG"], ["LIMIT", 1]]
SELECT "users".* FROM "users"
---
    def index

        if params[:username]
            @user = User.where("username LIKE '%#{params[:username].to_s}%' ")
            #debugger
            redirect_to user_url(@user[0])
            #render json: User.where("username LIKE '%#{params[:username].to_s}%' ")
        else
            render json: User.all

INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "David"], ["email", "davidhong@gmail.com"], ["created_at", "2022-06-29 20:18:42.578478"], ["updated_at", "2022-06-29 20:18:42.578478"]]
---
    def create
        @user = User.new(user_params)
        if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
---
    def show
        #debugger
        @user = User.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 3]]
---
    def destroy
        @user = User.find(params[:id])
        if @user.destroy

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["name", "Daniel"], ["updated_at", "2022-06-29 20:29:28.628679"], ["id", 3]]
---
    def update
        @user = User.find(params[:id])

        if @user.update(user_params)